RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_sei_regs.h
/*
 * STALL (RO)
 *
 * Program finished
 * 0: Program is executing
 * 1: Program finished
 */
#define SEI_CTRL_ENGINE_EXE_STA_STALL_MASK (0x1U)
#define SEI_CTRL_ENGINE_EXE_STA_STALL_SHIFT (0U)
#define SEI_CTRL_ENGINE_EXE_STA_STALL_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_EXE_STA_STALL_MASK) >> SEI_CTRL_ENGINE_EXE_STA_STALL_SHIFT)

/* Bitfield definition for register of struct array CTRL: EXE_PTR */
/*
 * HALT_CNT (RO)
 *
 * Halt count in halt instrution
 */
#define SEI_CTRL_ENGINE_EXE_PTR_HALT_CNT_MASK (0x1F000000UL)
#define SEI_CTRL_ENGINE_EXE_PTR_HALT_CNT_SHIFT (24U)
#define SEI_CTRL_ENGINE_EXE_PTR_HALT_CNT_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_EXE_PTR_HALT_CNT_MASK) >> SEI_CTRL_ENGINE_EXE_PTR_HALT_CNT_SHIFT)

/*
 * BIT_CNT (RO)
 *
 * Bit count in send and receive instruction execution
 */
#define SEI_CTRL_ENGINE_EXE_PTR_BIT_CNT_MASK (0x1F0000UL)
#define SEI_CTRL_ENGINE_EXE_PTR_BIT_CNT_SHIFT (16U)
#define SEI_CTRL_ENGINE_EXE_PTR_BIT_CNT_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_EXE_PTR_BIT_CNT_MASK) >> SEI_CTRL_ENGINE_EXE_PTR_BIT_CNT_SHIFT)

/*
 * POINTER (RO)
 *
 * Current program pointer
 */
#define SEI_CTRL_ENGINE_EXE_PTR_POINTER_MASK (0xFFU)
#define SEI_CTRL_ENGINE_EXE_PTR_POINTER_SHIFT (0U)
#define SEI_CTRL_ENGINE_EXE_PTR_POINTER_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_EXE_PTR_POINTER_MASK) >> SEI_CTRL_ENGINE_EXE_PTR_POINTER_SHIFT)

/* Bitfield definition for register of struct array CTRL: EXE_INST */
/*
 * INST (RO)
 *
 * Current instruction
 */
#define SEI_CTRL_ENGINE_EXE_INST_INST_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_ENGINE_EXE_INST_INST_SHIFT (0U)
#define SEI_CTRL_ENGINE_EXE_INST_INST_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_EXE_INST_INST_MASK) >> SEI_CTRL_ENGINE_EXE_INST_INST_SHIFT)

/* Bitfield definition for register of struct array CTRL: WDG_STA */
/*
 * WDOG_CNT (RO)
 *
 * Current watch dog counter value
 */
#define SEI_CTRL_ENGINE_WDG_STA_WDOG_CNT_MASK (0xFFFFU)
#define SEI_CTRL_ENGINE_WDG_STA_WDOG_CNT_SHIFT (0U)
#define SEI_CTRL_ENGINE_WDG_STA_WDOG_CNT_GET(x) (((uint32_t)(x) & SEI_CTRL_ENGINE_WDG_STA_WDOG_CNT_MASK) >> SEI_CTRL_ENGINE_WDG_STA_WDOG_CNT_SHIFT)

/* Bitfield definition for register of struct array CTRL: CTRL */
/*
 * TRISMP (RW)
 *
 * Tipple sampe
 * 0: sample 1 time for data transition
 * 1: sample 3 times in receive and result in 2oo3
 */
#define SEI_CTRL_XCVR_CTRL_TRISMP_MASK (0x1000U)
#define SEI_CTRL_XCVR_CTRL_TRISMP_SHIFT (12U)
#define SEI_CTRL_XCVR_CTRL_TRISMP_SET(x) (((uint32_t)(x) << SEI_CTRL_XCVR_CTRL_TRISMP_SHIFT) & SEI_CTRL_XCVR_CTRL_TRISMP_MASK)
#define SEI_CTRL_XCVR_CTRL_TRISMP_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_CTRL_TRISMP_MASK) >> SEI_CTRL_XCVR_CTRL_TRISMP_SHIFT)

/*
 * PAR_CLR (WC)
 *
 * Clear parity error, this is a self clear bit
 * 0: no effect
 * 1: clear parity error
 */
#define SEI_CTRL_XCVR_CTRL_PAR_CLR_MASK (0x100U)
#define SEI_CTRL_XCVR_CTRL_PAR_CLR_SHIFT (8U)
#define SEI_CTRL_XCVR_CTRL_PAR_CLR_SET(x) (((uint32_t)(x) << SEI_CTRL_XCVR_CTRL_PAR_CLR_SHIFT) & SEI_CTRL_XCVR_CTRL_PAR_CLR_MASK)
#define SEI_CTRL_XCVR_CTRL_PAR_CLR_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_CTRL_PAR_CLR_MASK) >> SEI_CTRL_XCVR_CTRL_PAR_CLR_SHIFT)

/*
 * RESTART (WC)
 *
 * Restart tranceiver, this is a self clear bit
 * 0: no effect
 * 1: reset tranceiver
 */
#define SEI_CTRL_XCVR_CTRL_RESTART_MASK (0x10U)
#define SEI_CTRL_XCVR_CTRL_RESTART_SHIFT (4U)
#define SEI_CTRL_XCVR_CTRL_RESTART_SET(x) (((uint32_t)(x) << SEI_CTRL_XCVR_CTRL_RESTART_SHIFT) & SEI_CTRL_XCVR_CTRL_RESTART_MASK)
#define SEI_CTRL_XCVR_CTRL_RESTART_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_CTRL_RESTART_MASK) >> SEI_CTRL_XCVR_CTRL_RESTART_SHIFT)

/*
 * MODE (RW)
 *
 * Tranceiver mode
 * 0: synchronous maaster
 * 1: synchronous slave
 * 2: asynchronous mode
 * 3: asynchronous mode
 */
#define SEI_CTRL_XCVR_CTRL_MODE_MASK (0x3U)
#define SEI_CTRL_XCVR_CTRL_MODE_SHIFT (0U)
#define SEI_CTRL_XCVR_CTRL_MODE_SET(x) (((uint32_t)(x) << SEI_CTRL_XCVR_CTRL_MODE_SHIFT) & SEI_CTRL_XCVR_CTRL_MODE_MASK)
#define SEI_CTRL_XCVR_CTRL_MODE_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_CTRL_MODE_MASK) >> SEI_CTRL_XCVR_CTRL_MODE_SHIFT)

/* Bitfield definition for register of struct array CTRL: TYPE_CFG */
/*
 * WAIT_LEN (RW)
 *
 * Number of extra stop bit for asynchronous mode
 * 0: 1 bit
 * 1: 2 bit
 * ...
 * 255: 256 bit
 */
#define SEI_CTRL_XCVR_TYPE_CFG_WAIT_LEN_MASK (0xFF000000UL)
#define SEI_CTRL_XCVR_TYPE_CFG_WAIT_LEN_SHIFT (24U)
#define SEI_CTRL_XCVR_TYPE_CFG_WAIT_LEN_SET(x) (((uint32_t)(x) << SEI_CTRL_XCVR_TYPE_CFG_WAIT_LEN_SHIFT) & SEI_CTRL_XCVR_TYPE_CFG_WAIT_LEN_MASK)
#define SEI_CTRL_XCVR_TYPE_CFG_WAIT_LEN_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_TYPE_CFG_WAIT_LEN_MASK) >> SEI_CTRL_XCVR_TYPE_CFG_WAIT_LEN_SHIFT)

/*
 * DATA_LEN (RW)
 *
 * Number of data bit for asynchronous mode
 * 0: 1 bit
 * 1: 2 bit
 * ...
 * 31: 32 bit
 */
#define SEI_CTRL_XCVR_TYPE_CFG_DATA_LEN_MASK (0x1F0000UL)
#define SEI_CTRL_XCVR_TYPE_CFG_DATA_LEN_SHIFT (16U)
#define SEI_CTRL_XCVR_TYPE_CFG_DATA_LEN_SET(x) (((uint32_t)(x) << SEI_CTRL_XCVR_TYPE_CFG_DATA_LEN_SHIFT) & SEI_CTRL_XCVR_TYPE_CFG_DATA_LEN_MASK)
#define SEI_CTRL_XCVR_TYPE_CFG_DATA_LEN_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_TYPE_CFG_DATA_LEN_MASK) >> SEI_CTRL_XCVR_TYPE_CFG_DATA_LEN_SHIFT)

/*
 * PAR_POL (RW)
 *
 * Polarity of parity for asynchronous mode
 * 0: even
 * 1: odd
 */
#define SEI_CTRL_XCVR_TYPE_CFG_PAR_POL_MASK (0x200U)
#define SEI_CTRL_XCVR_TYPE_CFG_PAR_POL_SHIFT (9U)
#define SEI_CTRL_XCVR_TYPE_CFG_PAR_POL_SET(x) (((uint32_t)(x) << SEI_CTRL_XCVR_TYPE_CFG_PAR_POL_SHIFT) & SEI_CTRL_XCVR_TYPE_CFG_PAR_POL_MASK)
#define SEI_CTRL_XCVR_TYPE_CFG_PAR_POL_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_TYPE_CFG_PAR_POL_MASK) >> SEI_CTRL_XCVR_TYPE_CFG_PAR_POL_SHIFT)

/*
 * PAR_EN (RW)
 *
 * enable parity check for asynchronous mode
 * 0: disable
 * 1: enable
 */
#define SEI_CTRL_XCVR_TYPE_CFG_PAR_EN_MASK (0x100U)
#define SEI_CTRL_XCVR_TYPE_CFG_PAR_EN_SHIFT (8U)
#define SEI_CTRL_XCVR_TYPE_CFG_PAR_EN_SET(x) (((uint32_t)(x) << SEI_CTRL_XCVR_TYPE_CFG_PAR_EN_SHIFT) & SEI_CTRL_XCVR_TYPE_CFG_PAR_EN_MASK)
#define SEI_CTRL_XCVR_TYPE_CFG_PAR_EN_GET(x) (((uint32_t)(x) & SEI_CTRL_XCVR_TYPE_CFG_PAR_EN_MASK) >> SEI_CTRL_XCVR_TYPE_CFG_PAR_EN_SHIFT)

