RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_sei_regs.h
/*
 * IN0_SEL (RW)
 *
 * Trigger 0 sigal selection
 * 0: trigger in 0
 * 1: trigger in 1
 * ...
 * 7: trigger in 7
 */
#define SEI_CTRL_TRG_IN_CFG_IN0_SEL_MASK (0x7U)
#define SEI_CTRL_TRG_IN_CFG_IN0_SEL_SHIFT (0U)
#define SEI_CTRL_TRG_IN_CFG_IN0_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_IN_CFG_IN0_SEL_SHIFT) & SEI_CTRL_TRG_IN_CFG_IN0_SEL_MASK)
#define SEI_CTRL_TRG_IN_CFG_IN0_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_IN_CFG_IN0_SEL_MASK) >> SEI_CTRL_TRG_IN_CFG_IN0_SEL_SHIFT)

/* Bitfield definition for register of struct array CTRL: SW */
/*
 * SOFT (WC)
 *
 * Software trigger (tigger 3). this bit is self-clear
 * 0: trigger source disabled
 * 1: trigger source enabled
 */
#define SEI_CTRL_TRG_SW_SOFT_MASK (0x1U)
#define SEI_CTRL_TRG_SW_SOFT_SHIFT (0U)
#define SEI_CTRL_TRG_SW_SOFT_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_SW_SOFT_SHIFT) & SEI_CTRL_TRG_SW_SOFT_MASK)
#define SEI_CTRL_TRG_SW_SOFT_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_SW_SOFT_MASK) >> SEI_CTRL_TRG_SW_SOFT_SHIFT)

/* Bitfield definition for register of struct array CTRL: PRD_CFG */
/*
 * ARMING (RW)
 *
 * Wait for trigger synchronous before trigger
 * 0: Trigger directly
 * 1: Wait trigger source before period trigger
 */
#define SEI_CTRL_TRG_PRD_CFG_ARMING_MASK (0x10000UL)
#define SEI_CTRL_TRG_PRD_CFG_ARMING_SHIFT (16U)
#define SEI_CTRL_TRG_PRD_CFG_ARMING_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_PRD_CFG_ARMING_SHIFT) & SEI_CTRL_TRG_PRD_CFG_ARMING_MASK)
#define SEI_CTRL_TRG_PRD_CFG_ARMING_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_PRD_CFG_ARMING_MASK) >> SEI_CTRL_TRG_PRD_CFG_ARMING_SHIFT)

/*
 * SYNC (RW)
 *
 * Synchronous
 * 0: Not synchronous
 * 1: Synchronous every trigger source
 */
#define SEI_CTRL_TRG_PRD_CFG_SYNC_MASK (0x1U)
#define SEI_CTRL_TRG_PRD_CFG_SYNC_SHIFT (0U)
#define SEI_CTRL_TRG_PRD_CFG_SYNC_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_PRD_CFG_SYNC_SHIFT) & SEI_CTRL_TRG_PRD_CFG_SYNC_MASK)
#define SEI_CTRL_TRG_PRD_CFG_SYNC_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_PRD_CFG_SYNC_MASK) >> SEI_CTRL_TRG_PRD_CFG_SYNC_SHIFT)

/* Bitfield definition for register of struct array CTRL: PRD */
/*
 * PERIOD (RW)
 *
 * Trigger period
 */
#define SEI_CTRL_TRG_PRD_PERIOD_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_TRG_PRD_PERIOD_SHIFT (0U)
#define SEI_CTRL_TRG_PRD_PERIOD_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_PRD_PERIOD_SHIFT) & SEI_CTRL_TRG_PRD_PERIOD_MASK)
#define SEI_CTRL_TRG_PRD_PERIOD_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_PRD_PERIOD_MASK) >> SEI_CTRL_TRG_PRD_PERIOD_SHIFT)

/* Bitfield definition for register of struct array CTRL: OUT_CFG */
/*
 * OUT3_EN (RW)
 *
 * Enable trigger 3
 * 0: disable trigger 3
 * 1: enable trigger 3
 */
#define SEI_CTRL_TRG_OUT_CFG_OUT3_EN_MASK (0x80000000UL)
#define SEI_CTRL_TRG_OUT_CFG_OUT3_EN_SHIFT (31U)
#define SEI_CTRL_TRG_OUT_CFG_OUT3_EN_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_OUT_CFG_OUT3_EN_SHIFT) & SEI_CTRL_TRG_OUT_CFG_OUT3_EN_MASK)
#define SEI_CTRL_TRG_OUT_CFG_OUT3_EN_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_OUT_CFG_OUT3_EN_MASK) >> SEI_CTRL_TRG_OUT_CFG_OUT3_EN_SHIFT)

/*
 * OUT3_SEL (RW)
 *
 * Trigger 3 sigal selection
 * 0: trigger out 0
 * 1: trigger out 1
 * ...
 * 7: trigger out 7
 */
#define SEI_CTRL_TRG_OUT_CFG_OUT3_SEL_MASK (0x7000000UL)
#define SEI_CTRL_TRG_OUT_CFG_OUT3_SEL_SHIFT (24U)
#define SEI_CTRL_TRG_OUT_CFG_OUT3_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_OUT_CFG_OUT3_SEL_SHIFT) & SEI_CTRL_TRG_OUT_CFG_OUT3_SEL_MASK)
#define SEI_CTRL_TRG_OUT_CFG_OUT3_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_OUT_CFG_OUT3_SEL_MASK) >> SEI_CTRL_TRG_OUT_CFG_OUT3_SEL_SHIFT)

/*
 * OUT2_EN (RW)
 *
 * Enable trigger 2
 * 0: disable trigger 2
 * 1: enable trigger 2
 */
#define SEI_CTRL_TRG_OUT_CFG_OUT2_EN_MASK (0x800000UL)
#define SEI_CTRL_TRG_OUT_CFG_OUT2_EN_SHIFT (23U)
#define SEI_CTRL_TRG_OUT_CFG_OUT2_EN_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_OUT_CFG_OUT2_EN_SHIFT) & SEI_CTRL_TRG_OUT_CFG_OUT2_EN_MASK)
#define SEI_CTRL_TRG_OUT_CFG_OUT2_EN_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_OUT_CFG_OUT2_EN_MASK) >> SEI_CTRL_TRG_OUT_CFG_OUT2_EN_SHIFT)

/*
 * OUT2_SEL (RW)
 *
 * Trigger 2 sigal selection
 * 0: trigger out 0
 * 1: trigger out 1
 * ...
 * 7: trigger out 7
 */
#define SEI_CTRL_TRG_OUT_CFG_OUT2_SEL_MASK (0x70000UL)
#define SEI_CTRL_TRG_OUT_CFG_OUT2_SEL_SHIFT (16U)
#define SEI_CTRL_TRG_OUT_CFG_OUT2_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_OUT_CFG_OUT2_SEL_SHIFT) & SEI_CTRL_TRG_OUT_CFG_OUT2_SEL_MASK)
#define SEI_CTRL_TRG_OUT_CFG_OUT2_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_OUT_CFG_OUT2_SEL_MASK) >> SEI_CTRL_TRG_OUT_CFG_OUT2_SEL_SHIFT)

/*
 * OUT1_EN (RW)
 *
 * Enable trigger 1
 * 0: disable trigger 1
 * 1: enable trigger 1
 */
#define SEI_CTRL_TRG_OUT_CFG_OUT1_EN_MASK (0x8000U)
#define SEI_CTRL_TRG_OUT_CFG_OUT1_EN_SHIFT (15U)
#define SEI_CTRL_TRG_OUT_CFG_OUT1_EN_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_OUT_CFG_OUT1_EN_SHIFT) & SEI_CTRL_TRG_OUT_CFG_OUT1_EN_MASK)
#define SEI_CTRL_TRG_OUT_CFG_OUT1_EN_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_OUT_CFG_OUT1_EN_MASK) >> SEI_CTRL_TRG_OUT_CFG_OUT1_EN_SHIFT)

/*
 * OUT1_SEL (RW)
 *
 * Trigger 1 sigal selection
 * 0: trigger out 0
 * 1: trigger out 1
 * ...
 * 7: trigger out 7
 */
#define SEI_CTRL_TRG_OUT_CFG_OUT1_SEL_MASK (0x700U)
#define SEI_CTRL_TRG_OUT_CFG_OUT1_SEL_SHIFT (8U)
#define SEI_CTRL_TRG_OUT_CFG_OUT1_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_OUT_CFG_OUT1_SEL_SHIFT) & SEI_CTRL_TRG_OUT_CFG_OUT1_SEL_MASK)
#define SEI_CTRL_TRG_OUT_CFG_OUT1_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_OUT_CFG_OUT1_SEL_MASK) >> SEI_CTRL_TRG_OUT_CFG_OUT1_SEL_SHIFT)

/*
 * OUT0_EN (RW)
 *
 * Enable trigger 0
 * 0: disable trigger 1
 * 1: enable trigger 1
 */
#define SEI_CTRL_TRG_OUT_CFG_OUT0_EN_MASK (0x80U)
#define SEI_CTRL_TRG_OUT_CFG_OUT0_EN_SHIFT (7U)
#define SEI_CTRL_TRG_OUT_CFG_OUT0_EN_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_OUT_CFG_OUT0_EN_SHIFT) & SEI_CTRL_TRG_OUT_CFG_OUT0_EN_MASK)
#define SEI_CTRL_TRG_OUT_CFG_OUT0_EN_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_OUT_CFG_OUT0_EN_MASK) >> SEI_CTRL_TRG_OUT_CFG_OUT0_EN_SHIFT)

/*
 * OUT0_SEL (RW)
 *
 * Trigger 0 sigal selection
 * 0: trigger out 0
 * 1: trigger out 1
 * ...
 * 7: trigger out 7
 */
#define SEI_CTRL_TRG_OUT_CFG_OUT0_SEL_MASK (0x7U)
#define SEI_CTRL_TRG_OUT_CFG_OUT0_SEL_SHIFT (0U)
#define SEI_CTRL_TRG_OUT_CFG_OUT0_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_TRG_OUT_CFG_OUT0_SEL_SHIFT) & SEI_CTRL_TRG_OUT_CFG_OUT0_SEL_MASK)
#define SEI_CTRL_TRG_OUT_CFG_OUT0_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_OUT_CFG_OUT0_SEL_MASK) >> SEI_CTRL_TRG_OUT_CFG_OUT0_SEL_SHIFT)

/* Bitfield definition for register of struct array CTRL: PRD_STS */
/*
 * TRIGERED (RO)
 *
 * Period has been triggered
 * 0: Not triggered
 * 1: Triggered
 */
#define SEI_CTRL_TRG_PRD_STS_TRIGERED_MASK (0x100000UL)
#define SEI_CTRL_TRG_PRD_STS_TRIGERED_SHIFT (20U)
#define SEI_CTRL_TRG_PRD_STS_TRIGERED_GET(x) (((uint32_t)(x) & SEI_CTRL_TRG_PRD_STS_TRIGERED_MASK) >> SEI_CTRL_TRG_PRD_STS_TRIGERED_SHIFT)

