RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_sei_regs.h
/*
 * PTR9 (RW)
 *
 * pointer9
 */
#define SEI_CTRL_CMD_TABLE_PTC_PTR9_MASK (0xFF00U)
#define SEI_CTRL_CMD_TABLE_PTC_PTR9_SHIFT (8U)
#define SEI_CTRL_CMD_TABLE_PTC_PTR9_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTC_PTR9_SHIFT) & SEI_CTRL_CMD_TABLE_PTC_PTR9_MASK)
#define SEI_CTRL_CMD_TABLE_PTC_PTR9_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTC_PTR9_MASK) >> SEI_CTRL_CMD_TABLE_PTC_PTR9_SHIFT)

/*
 * PTR8 (RW)
 *
 * pointer8
 */
#define SEI_CTRL_CMD_TABLE_PTC_PTR8_MASK (0xFFU)
#define SEI_CTRL_CMD_TABLE_PTC_PTR8_SHIFT (0U)
#define SEI_CTRL_CMD_TABLE_PTC_PTR8_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTC_PTR8_SHIFT) & SEI_CTRL_CMD_TABLE_PTC_PTR8_MASK)
#define SEI_CTRL_CMD_TABLE_PTC_PTR8_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTC_PTR8_MASK) >> SEI_CTRL_CMD_TABLE_PTC_PTR8_SHIFT)

/* Bitfield definition for register of struct array CTRL: PTD */
/*
 * PTR15 (RW)
 *
 * pointer15
 */
#define SEI_CTRL_CMD_TABLE_PTD_PTR15_MASK (0xFF000000UL)
#define SEI_CTRL_CMD_TABLE_PTD_PTR15_SHIFT (24U)
#define SEI_CTRL_CMD_TABLE_PTD_PTR15_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTD_PTR15_SHIFT) & SEI_CTRL_CMD_TABLE_PTD_PTR15_MASK)
#define SEI_CTRL_CMD_TABLE_PTD_PTR15_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTD_PTR15_MASK) >> SEI_CTRL_CMD_TABLE_PTD_PTR15_SHIFT)

/*
 * PTR14 (RW)
 *
 * pointer14
 */
#define SEI_CTRL_CMD_TABLE_PTD_PTR14_MASK (0xFF0000UL)
#define SEI_CTRL_CMD_TABLE_PTD_PTR14_SHIFT (16U)
#define SEI_CTRL_CMD_TABLE_PTD_PTR14_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTD_PTR14_SHIFT) & SEI_CTRL_CMD_TABLE_PTD_PTR14_MASK)
#define SEI_CTRL_CMD_TABLE_PTD_PTR14_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTD_PTR14_MASK) >> SEI_CTRL_CMD_TABLE_PTD_PTR14_SHIFT)

/*
 * PTR13 (RW)
 *
 * pointer13
 */
#define SEI_CTRL_CMD_TABLE_PTD_PTR13_MASK (0xFF00U)
#define SEI_CTRL_CMD_TABLE_PTD_PTR13_SHIFT (8U)
#define SEI_CTRL_CMD_TABLE_PTD_PTR13_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTD_PTR13_SHIFT) & SEI_CTRL_CMD_TABLE_PTD_PTR13_MASK)
#define SEI_CTRL_CMD_TABLE_PTD_PTR13_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTD_PTR13_MASK) >> SEI_CTRL_CMD_TABLE_PTD_PTR13_SHIFT)

/*
 * PTR12 (RW)
 *
 * pointer12
 */
#define SEI_CTRL_CMD_TABLE_PTD_PTR12_MASK (0xFFU)
#define SEI_CTRL_CMD_TABLE_PTD_PTR12_SHIFT (0U)
#define SEI_CTRL_CMD_TABLE_PTD_PTR12_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_TABLE_PTD_PTR12_SHIFT) & SEI_CTRL_CMD_TABLE_PTD_PTR12_MASK)
#define SEI_CTRL_CMD_TABLE_PTD_PTR12_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_TABLE_PTD_PTR12_MASK) >> SEI_CTRL_CMD_TABLE_PTD_PTR12_SHIFT)

/* Bitfield definition for register of struct array CTRL: 0_1 */
/*
 * POINTER (RW)
 *
 * pointer
 */
#define SEI_CTRL_LATCH_TRAN_POINTER_MASK (0xFF000000UL)
#define SEI_CTRL_LATCH_TRAN_POINTER_SHIFT (24U)
#define SEI_CTRL_LATCH_TRAN_POINTER_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_POINTER_SHIFT) & SEI_CTRL_LATCH_TRAN_POINTER_MASK)
#define SEI_CTRL_LATCH_TRAN_POINTER_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_POINTER_MASK) >> SEI_CTRL_LATCH_TRAN_POINTER_SHIFT)

/*
 * CFG_TM (RW)
 *
 * timeout
 * 0: high
 * 1: low
 * 2: rise
 * 3: fall
 */
#define SEI_CTRL_LATCH_TRAN_CFG_TM_MASK (0x30000UL)
#define SEI_CTRL_LATCH_TRAN_CFG_TM_SHIFT (16U)
#define SEI_CTRL_LATCH_TRAN_CFG_TM_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_CFG_TM_SHIFT) & SEI_CTRL_LATCH_TRAN_CFG_TM_MASK)
#define SEI_CTRL_LATCH_TRAN_CFG_TM_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_CFG_TM_MASK) >> SEI_CTRL_LATCH_TRAN_CFG_TM_SHIFT)

/*
 * CFG_RXD (RW)
 *
 * data received
 * 0: high
 * 1: low
 * 2: rise
 * 3: fall
 */
#define SEI_CTRL_LATCH_TRAN_CFG_RXD_MASK (0xC000U)
#define SEI_CTRL_LATCH_TRAN_CFG_RXD_SHIFT (14U)
#define SEI_CTRL_LATCH_TRAN_CFG_RXD_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_CFG_RXD_SHIFT) & SEI_CTRL_LATCH_TRAN_CFG_RXD_MASK)
#define SEI_CTRL_LATCH_TRAN_CFG_RXD_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_CFG_RXD_MASK) >> SEI_CTRL_LATCH_TRAN_CFG_RXD_SHIFT)

/*
 * CFG_TXD (RW)
 *
 * data send
 * 0: high
 * 1: low
 * 2: rise
 * 3: fall
 */
#define SEI_CTRL_LATCH_TRAN_CFG_TXD_MASK (0x3000U)
#define SEI_CTRL_LATCH_TRAN_CFG_TXD_SHIFT (12U)
#define SEI_CTRL_LATCH_TRAN_CFG_TXD_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_CFG_TXD_SHIFT) & SEI_CTRL_LATCH_TRAN_CFG_TXD_MASK)
#define SEI_CTRL_LATCH_TRAN_CFG_TXD_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_CFG_TXD_MASK) >> SEI_CTRL_LATCH_TRAN_CFG_TXD_SHIFT)

/*
 * CFG_CLK (RW)
 *
 * clock
 * 0: high
 * 1: low
 * 2: rise
 * 3: fall
 */
#define SEI_CTRL_LATCH_TRAN_CFG_CLK_MASK (0xC00U)
#define SEI_CTRL_LATCH_TRAN_CFG_CLK_SHIFT (10U)
#define SEI_CTRL_LATCH_TRAN_CFG_CLK_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_CFG_CLK_SHIFT) & SEI_CTRL_LATCH_TRAN_CFG_CLK_MASK)
#define SEI_CTRL_LATCH_TRAN_CFG_CLK_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_CFG_CLK_MASK) >> SEI_CTRL_LATCH_TRAN_CFG_CLK_SHIFT)

/*
 * CFG_PTR (RW)
 *
 * pointer
 * 0: match
 * 1: not match
 * 2:entry
 * 3:leave
 */
#define SEI_CTRL_LATCH_TRAN_CFG_PTR_MASK (0x300U)
#define SEI_CTRL_LATCH_TRAN_CFG_PTR_SHIFT (8U)
#define SEI_CTRL_LATCH_TRAN_CFG_PTR_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_CFG_PTR_SHIFT) & SEI_CTRL_LATCH_TRAN_CFG_PTR_MASK)
#define SEI_CTRL_LATCH_TRAN_CFG_PTR_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_CFG_PTR_MASK) >> SEI_CTRL_LATCH_TRAN_CFG_PTR_SHIFT)

/*
 * OV_TM (RW)
 *
 * override timeout check
 */
#define SEI_CTRL_LATCH_TRAN_OV_TM_MASK (0x10U)
#define SEI_CTRL_LATCH_TRAN_OV_TM_SHIFT (4U)
#define SEI_CTRL_LATCH_TRAN_OV_TM_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_OV_TM_SHIFT) & SEI_CTRL_LATCH_TRAN_OV_TM_MASK)
#define SEI_CTRL_LATCH_TRAN_OV_TM_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_OV_TM_MASK) >> SEI_CTRL_LATCH_TRAN_OV_TM_SHIFT)

/*
 * OV_RXD (RW)
 *
 * override RX data check
 */
#define SEI_CTRL_LATCH_TRAN_OV_RXD_MASK (0x8U)
#define SEI_CTRL_LATCH_TRAN_OV_RXD_SHIFT (3U)
#define SEI_CTRL_LATCH_TRAN_OV_RXD_SET(x) (((uint32_t)(x) << SEI_CTRL_LATCH_TRAN_OV_RXD_SHIFT) & SEI_CTRL_LATCH_TRAN_OV_RXD_MASK)
#define SEI_CTRL_LATCH_TRAN_OV_RXD_GET(x) (((uint32_t)(x) & SEI_CTRL_LATCH_TRAN_OV_RXD_MASK) >> SEI_CTRL_LATCH_TRAN_OV_RXD_SHIFT)

