RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_sei_regs.h
/*
 * SPD_SEL (RW)
 *
 * Data register for speed transfer
 */
#define SEI_CTRL_POS_UPD_EN_SPD_SEL_MASK (0x1F0000UL)
#define SEI_CTRL_POS_UPD_EN_SPD_SEL_SHIFT (16U)
#define SEI_CTRL_POS_UPD_EN_SPD_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_UPD_EN_SPD_SEL_SHIFT) & SEI_CTRL_POS_UPD_EN_SPD_SEL_MASK)
#define SEI_CTRL_POS_UPD_EN_SPD_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_UPD_EN_SPD_SEL_MASK) >> SEI_CTRL_POS_UPD_EN_SPD_SEL_SHIFT)

/*
 * REV_EN (RW)
 *
 * Position include revolution
 * 0: use revolution from update override revolution register
 * 1: use revolution from data register
 */
#define SEI_CTRL_POS_UPD_EN_REV_EN_MASK (0x8000U)
#define SEI_CTRL_POS_UPD_EN_REV_EN_SHIFT (15U)
#define SEI_CTRL_POS_UPD_EN_REV_EN_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_UPD_EN_REV_EN_SHIFT) & SEI_CTRL_POS_UPD_EN_REV_EN_MASK)
#define SEI_CTRL_POS_UPD_EN_REV_EN_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_UPD_EN_REV_EN_MASK) >> SEI_CTRL_POS_UPD_EN_REV_EN_SHIFT)

/*
 * REV_SEL (RW)
 *
 * Data register for revolution transfer
 */
#define SEI_CTRL_POS_UPD_EN_REV_SEL_MASK (0x1F00U)
#define SEI_CTRL_POS_UPD_EN_REV_SEL_SHIFT (8U)
#define SEI_CTRL_POS_UPD_EN_REV_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_UPD_EN_REV_SEL_SHIFT) & SEI_CTRL_POS_UPD_EN_REV_SEL_MASK)
#define SEI_CTRL_POS_UPD_EN_REV_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_UPD_EN_REV_SEL_MASK) >> SEI_CTRL_POS_UPD_EN_REV_SEL_SHIFT)

/*
 * POS_EN (RW)
 *
 * Position include position
 * 0: use position from update override position register
 * 1: use position from data register
 */
#define SEI_CTRL_POS_UPD_EN_POS_EN_MASK (0x80U)
#define SEI_CTRL_POS_UPD_EN_POS_EN_SHIFT (7U)
#define SEI_CTRL_POS_UPD_EN_POS_EN_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_UPD_EN_POS_EN_SHIFT) & SEI_CTRL_POS_UPD_EN_POS_EN_MASK)
#define SEI_CTRL_POS_UPD_EN_POS_EN_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_UPD_EN_POS_EN_MASK) >> SEI_CTRL_POS_UPD_EN_POS_EN_SHIFT)

/*
 * POS_SEL (RW)
 *
 * Data register for position transfer
 */
#define SEI_CTRL_POS_UPD_EN_POS_SEL_MASK (0x1FU)
#define SEI_CTRL_POS_UPD_EN_POS_SEL_SHIFT (0U)
#define SEI_CTRL_POS_UPD_EN_POS_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_UPD_EN_POS_SEL_SHIFT) & SEI_CTRL_POS_UPD_EN_POS_SEL_MASK)
#define SEI_CTRL_POS_UPD_EN_POS_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_UPD_EN_POS_SEL_MASK) >> SEI_CTRL_POS_UPD_EN_POS_SEL_SHIFT)

/* Bitfield definition for register of struct array CTRL: UPD_CFG */
/*
 * TIME_OVRD (RW)
 *
 * Use override time
 * 0: use time sample from motor group
 * 1: use override time
 */
#define SEI_CTRL_POS_UPD_CFG_TIME_OVRD_MASK (0x80000000UL)
#define SEI_CTRL_POS_UPD_CFG_TIME_OVRD_SHIFT (31U)
#define SEI_CTRL_POS_UPD_CFG_TIME_OVRD_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_UPD_CFG_TIME_OVRD_SHIFT) & SEI_CTRL_POS_UPD_CFG_TIME_OVRD_MASK)
#define SEI_CTRL_POS_UPD_CFG_TIME_OVRD_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_UPD_CFG_TIME_OVRD_MASK) >> SEI_CTRL_POS_UPD_CFG_TIME_OVRD_SHIFT)

/*
 * ONERR (RW)
 *
 * Sample one time
 * 0: Sample during windows time
 * 1: Close sample window after first sample
 */
#define SEI_CTRL_POS_UPD_CFG_ONERR_MASK (0x1000000UL)
#define SEI_CTRL_POS_UPD_CFG_ONERR_SHIFT (24U)
#define SEI_CTRL_POS_UPD_CFG_ONERR_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_UPD_CFG_ONERR_SHIFT) & SEI_CTRL_POS_UPD_CFG_ONERR_MASK)
#define SEI_CTRL_POS_UPD_CFG_ONERR_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_UPD_CFG_ONERR_MASK) >> SEI_CTRL_POS_UPD_CFG_ONERR_SHIFT)

/*
 * LAT_SEL (RW)
 *
 * Latch selection
 * 0: latch 0
 * 1: latch 1
 * 2: latch 2
 * 3: latch 3
 */
#define SEI_CTRL_POS_UPD_CFG_LAT_SEL_MASK (0x30000UL)
#define SEI_CTRL_POS_UPD_CFG_LAT_SEL_SHIFT (16U)
#define SEI_CTRL_POS_UPD_CFG_LAT_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_UPD_CFG_LAT_SEL_SHIFT) & SEI_CTRL_POS_UPD_CFG_LAT_SEL_MASK)
#define SEI_CTRL_POS_UPD_CFG_LAT_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_UPD_CFG_LAT_SEL_MASK) >> SEI_CTRL_POS_UPD_CFG_LAT_SEL_SHIFT)

/* Bitfield definition for register of struct array CTRL: UPD_DAT */
/*
 * DAT_SEL (RW)
 *
 * Data register sampled, each bit represent a data register
 */
#define SEI_CTRL_POS_UPD_DAT_DAT_SEL_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_POS_UPD_DAT_DAT_SEL_SHIFT (0U)
#define SEI_CTRL_POS_UPD_DAT_DAT_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_UPD_DAT_DAT_SEL_SHIFT) & SEI_CTRL_POS_UPD_DAT_DAT_SEL_MASK)
#define SEI_CTRL_POS_UPD_DAT_DAT_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_UPD_DAT_DAT_SEL_MASK) >> SEI_CTRL_POS_UPD_DAT_DAT_SEL_SHIFT)

/* Bitfield definition for register of struct array CTRL: UPD_TIME */
/*
 * TIME (RW)
 *
 * Update override time
 */
#define SEI_CTRL_POS_UPD_TIME_TIME_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_POS_UPD_TIME_TIME_SHIFT (0U)
#define SEI_CTRL_POS_UPD_TIME_TIME_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_UPD_TIME_TIME_SHIFT) & SEI_CTRL_POS_UPD_TIME_TIME_MASK)
#define SEI_CTRL_POS_UPD_TIME_TIME_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_UPD_TIME_TIME_MASK) >> SEI_CTRL_POS_UPD_TIME_TIME_SHIFT)

/* Bitfield definition for register of struct array CTRL: UPD_POS */
/*
 * POS (RW)
 *
 * Update override position
 */
#define SEI_CTRL_POS_UPD_POS_POS_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_POS_UPD_POS_POS_SHIFT (0U)
#define SEI_CTRL_POS_UPD_POS_POS_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_UPD_POS_POS_SHIFT) & SEI_CTRL_POS_UPD_POS_POS_MASK)
#define SEI_CTRL_POS_UPD_POS_POS_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_UPD_POS_POS_MASK) >> SEI_CTRL_POS_UPD_POS_POS_SHIFT)

/* Bitfield definition for register of struct array CTRL: UPD_REV */
/*
 * REV (RW)
 *
 * Update override revolution
 */
#define SEI_CTRL_POS_UPD_REV_REV_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_POS_UPD_REV_REV_SHIFT (0U)
#define SEI_CTRL_POS_UPD_REV_REV_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_UPD_REV_REV_SHIFT) & SEI_CTRL_POS_UPD_REV_REV_MASK)
#define SEI_CTRL_POS_UPD_REV_REV_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_UPD_REV_REV_MASK) >> SEI_CTRL_POS_UPD_REV_REV_SHIFT)

/* Bitfield definition for register of struct array CTRL: UPD_SPD */
/*
 * SPD (RW)
 *
 * Update override speed
 */
#define SEI_CTRL_POS_UPD_SPD_SPD_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_POS_UPD_SPD_SPD_SHIFT (0U)
#define SEI_CTRL_POS_UPD_SPD_SPD_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_UPD_SPD_SPD_SHIFT) & SEI_CTRL_POS_UPD_SPD_SPD_MASK)
#define SEI_CTRL_POS_UPD_SPD_SPD_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_UPD_SPD_SPD_MASK) >> SEI_CTRL_POS_UPD_SPD_SPD_SHIFT)

/* Bitfield definition for register of struct array CTRL: UPD_ACC */
/*
 * ACC (RW)
 *
 * Update override accelerate
 */
#define SEI_CTRL_POS_UPD_ACC_ACC_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_POS_UPD_ACC_ACC_SHIFT (0U)
#define SEI_CTRL_POS_UPD_ACC_ACC_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_UPD_ACC_ACC_SHIFT) & SEI_CTRL_POS_UPD_ACC_ACC_MASK)
#define SEI_CTRL_POS_UPD_ACC_ACC_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_UPD_ACC_ACC_MASK) >> SEI_CTRL_POS_UPD_ACC_ACC_SHIFT)

