RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_sei_regs.h
/* Bitfield definition for register of struct array CTRL: SMP_VAL */
/*
 * ACC (RO)
 *
 * Position include acceleration
 */
#define SEI_CTRL_POS_SMP_VAL_ACC_MASK (0x80000000UL)
#define SEI_CTRL_POS_SMP_VAL_ACC_SHIFT (31U)
#define SEI_CTRL_POS_SMP_VAL_ACC_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_VAL_ACC_MASK) >> SEI_CTRL_POS_SMP_VAL_ACC_SHIFT)

/*
 * SPD (RO)
 *
 * Position include speed
 */
#define SEI_CTRL_POS_SMP_VAL_SPD_MASK (0x800000UL)
#define SEI_CTRL_POS_SMP_VAL_SPD_SHIFT (23U)
#define SEI_CTRL_POS_SMP_VAL_SPD_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_VAL_SPD_MASK) >> SEI_CTRL_POS_SMP_VAL_SPD_SHIFT)

/*
 * REV (RO)
 *
 * Position include revolution
 */
#define SEI_CTRL_POS_SMP_VAL_REV_MASK (0x8000U)
#define SEI_CTRL_POS_SMP_VAL_REV_SHIFT (15U)
#define SEI_CTRL_POS_SMP_VAL_REV_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_VAL_REV_MASK) >> SEI_CTRL_POS_SMP_VAL_REV_SHIFT)

/*
 * POS (RO)
 *
 * Position include position
 */
#define SEI_CTRL_POS_SMP_VAL_POS_MASK (0x80U)
#define SEI_CTRL_POS_SMP_VAL_POS_SHIFT (7U)
#define SEI_CTRL_POS_SMP_VAL_POS_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_VAL_POS_MASK) >> SEI_CTRL_POS_SMP_VAL_POS_SHIFT)

/* Bitfield definition for register of struct array CTRL: SMP_STS */
/*
 * OCCUR (RO)
 *
 * Sample occured
 * 0: Sample not happened
 * 1: Sample occured
 */
#define SEI_CTRL_POS_SMP_STS_OCCUR_MASK (0x1000000UL)
#define SEI_CTRL_POS_SMP_STS_OCCUR_SHIFT (24U)
#define SEI_CTRL_POS_SMP_STS_OCCUR_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_STS_OCCUR_MASK) >> SEI_CTRL_POS_SMP_STS_OCCUR_SHIFT)

/*
 * WIN_CNT (RO)
 *
 * Sample window counter
 */
#define SEI_CTRL_POS_SMP_STS_WIN_CNT_MASK (0xFFFFU)
#define SEI_CTRL_POS_SMP_STS_WIN_CNT_SHIFT (0U)
#define SEI_CTRL_POS_SMP_STS_WIN_CNT_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_STS_WIN_CNT_MASK) >> SEI_CTRL_POS_SMP_STS_WIN_CNT_SHIFT)

/* Bitfield definition for register of struct array CTRL: TIME_IN */
/*
 * TIME (RO)
 *
 * input time
 */
#define SEI_CTRL_POS_TIME_IN_TIME_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_POS_TIME_IN_TIME_SHIFT (0U)
#define SEI_CTRL_POS_TIME_IN_TIME_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_TIME_IN_TIME_MASK) >> SEI_CTRL_POS_TIME_IN_TIME_SHIFT)

/* Bitfield definition for register of struct array CTRL: POS_IN */
/*
 * POS (RO)
 *
 * Input position
 */
#define SEI_CTRL_POS_POS_IN_POS_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_POS_POS_IN_POS_SHIFT (0U)
#define SEI_CTRL_POS_POS_IN_POS_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_POS_IN_POS_MASK) >> SEI_CTRL_POS_POS_IN_POS_SHIFT)

/* Bitfield definition for register of struct array CTRL: REV_IN */
/*
 * REV (RO)
 *
 * Input revolution
 */
#define SEI_CTRL_POS_REV_IN_REV_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_POS_REV_IN_REV_SHIFT (0U)
#define SEI_CTRL_POS_REV_IN_REV_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_REV_IN_REV_MASK) >> SEI_CTRL_POS_REV_IN_REV_SHIFT)

/* Bitfield definition for register of struct array CTRL: SPD_IN */
/*
 * SPD (RO)
 *
 * Input speed
 */
#define SEI_CTRL_POS_SPD_IN_SPD_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_POS_SPD_IN_SPD_SHIFT (0U)
#define SEI_CTRL_POS_SPD_IN_SPD_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SPD_IN_SPD_MASK) >> SEI_CTRL_POS_SPD_IN_SPD_SHIFT)

/* Bitfield definition for register of struct array CTRL: ACC_IN */
/*
 * ACC (RO)
 *
 * Input accelerate
 */
#define SEI_CTRL_POS_ACC_IN_ACC_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_POS_ACC_IN_ACC_SHIFT (0U)
#define SEI_CTRL_POS_ACC_IN_ACC_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_ACC_IN_ACC_MASK) >> SEI_CTRL_POS_ACC_IN_ACC_SHIFT)

/* Bitfield definition for register of struct array CTRL: UPD_STS */
/*
 * UPD_ERR (RO)
 *
 * Update  error
 * 0: data receive normally
 * 1: data receive error
 */
#define SEI_CTRL_POS_UPD_STS_UPD_ERR_MASK (0x1000000UL)
#define SEI_CTRL_POS_UPD_STS_UPD_ERR_SHIFT (24U)
#define SEI_CTRL_POS_UPD_STS_UPD_ERR_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_UPD_STS_UPD_ERR_MASK) >> SEI_CTRL_POS_UPD_STS_UPD_ERR_SHIFT)

/* Bitfield definition for register of struct array CTRL: INT_EN */
/*
 * TRG_ERR3 (RW)
 *
 * Trigger3 failed
 */
#define SEI_CTRL_IRQ_INT_EN_TRG_ERR3_MASK (0x80000000UL)
#define SEI_CTRL_IRQ_INT_EN_TRG_ERR3_SHIFT (31U)
#define SEI_CTRL_IRQ_INT_EN_TRG_ERR3_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_EN_TRG_ERR3_SHIFT) & SEI_CTRL_IRQ_INT_EN_TRG_ERR3_MASK)
#define SEI_CTRL_IRQ_INT_EN_TRG_ERR3_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_EN_TRG_ERR3_MASK) >> SEI_CTRL_IRQ_INT_EN_TRG_ERR3_SHIFT)

/*
 * TRG_ERR2 (RW)
 *
 * Trigger2 failed
 */
#define SEI_CTRL_IRQ_INT_EN_TRG_ERR2_MASK (0x40000000UL)
#define SEI_CTRL_IRQ_INT_EN_TRG_ERR2_SHIFT (30U)
#define SEI_CTRL_IRQ_INT_EN_TRG_ERR2_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_EN_TRG_ERR2_SHIFT) & SEI_CTRL_IRQ_INT_EN_TRG_ERR2_MASK)
#define SEI_CTRL_IRQ_INT_EN_TRG_ERR2_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_EN_TRG_ERR2_MASK) >> SEI_CTRL_IRQ_INT_EN_TRG_ERR2_SHIFT)

/*
 * TRG_ERR1 (RW)
 *
 * Trigger1 failed
 */
#define SEI_CTRL_IRQ_INT_EN_TRG_ERR1_MASK (0x20000000UL)
#define SEI_CTRL_IRQ_INT_EN_TRG_ERR1_SHIFT (29U)
#define SEI_CTRL_IRQ_INT_EN_TRG_ERR1_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_EN_TRG_ERR1_SHIFT) & SEI_CTRL_IRQ_INT_EN_TRG_ERR1_MASK)
#define SEI_CTRL_IRQ_INT_EN_TRG_ERR1_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_EN_TRG_ERR1_MASK) >> SEI_CTRL_IRQ_INT_EN_TRG_ERR1_SHIFT)

/*
 * TRG_ERR0 (RW)
 *
 * Trigger0 failed
 */
#define SEI_CTRL_IRQ_INT_EN_TRG_ERR0_MASK (0x10000000UL)
#define SEI_CTRL_IRQ_INT_EN_TRG_ERR0_SHIFT (28U)
#define SEI_CTRL_IRQ_INT_EN_TRG_ERR0_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_EN_TRG_ERR0_SHIFT) & SEI_CTRL_IRQ_INT_EN_TRG_ERR0_MASK)
#define SEI_CTRL_IRQ_INT_EN_TRG_ERR0_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_EN_TRG_ERR0_MASK) >> SEI_CTRL_IRQ_INT_EN_TRG_ERR0_SHIFT)

/*
 * TRIGER3 (RW)
 *
 * Trigger3
 */
#define SEI_CTRL_IRQ_INT_EN_TRIGER3_MASK (0x8000000UL)
#define SEI_CTRL_IRQ_INT_EN_TRIGER3_SHIFT (27U)
#define SEI_CTRL_IRQ_INT_EN_TRIGER3_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_EN_TRIGER3_SHIFT) & SEI_CTRL_IRQ_INT_EN_TRIGER3_MASK)
#define SEI_CTRL_IRQ_INT_EN_TRIGER3_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_EN_TRIGER3_MASK) >> SEI_CTRL_IRQ_INT_EN_TRIGER3_SHIFT)

